sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
#include <xc.h>
#include <stdint.h>
#include <string.h>

#include "nora_uart.h"
#include "nora_uart_dspic33ck_device.h"
#include "nora_uart_dspic33ck_reg.h"
#include "nora_uart_dspic33ck_rx_isr_ring.h"

#define NORA_UART_BRG_MAX 0x000FFFFFUL

static bool initialized[NORA_UART_INST_COUNT];
static uint32_t timeout_ms[NORA_UART_INST_COUNT];
static nora_uart_get_ms_fn get_ms[NORA_UART_INST_COUNT];
static uint32_t baudrate_applied[NORA_UART_INST_COUNT];
/* The clock the divisor was computed against. Kept so nora_uart_set_baudrate()
 * leaves the instance context describing the rate that is actually on the wire,
 * as the dsPIC33AK HAL does. */
static uint32_t uart_clk_hz_applied[NORA_UART_INST_COUNT];
/* How many latched RX overruns the reader has had to end -- see
 * nora_uart_rx_ready(). Each one was a reception that used to stop for good, so
 * a non-zero value is a defect SURVIVED, and 0 is what a healthy board reports. */
static volatile uint32_t rx_overrun_recovered[NORA_UART_INST_COUNT];
/* Bytes this backend has handed to a POLLED reader. The ISR ring keeps its own
 * count, but a polled console never configures the ring, so without this the
 * rx_byte_count field is zero on a board where reception demonstrably works --
 * which makes it useless as evidence exactly when evidence is wanted. */
static volatile uint32_t rx_byte_polled[NORA_UART_INST_COUNT];
/* Framing/parity errors the POLLED reader has discarded. These used to be
 * ISR-ring-only fields, which meant they read zero on a polled console no matter
 * how many errored bytes arrived -- see nora_uart_read_byte() for what that cost. */
static volatile uint32_t rx_framing_polled[NORA_UART_INST_COUNT];
static volatile uint32_t rx_parity_polled[NORA_UART_INST_COUNT];

/* Asynchronous transfer model state. Inert until nora_uart_tx_start() /
 * _rx_start() / _rx_start_clean() is called, so a build that never uses it pays
 * only for these words (the code itself is dropped by isolate-each-function +
 * remove-unused-sections). */
static uint8_t tx_irq_priority_applied[NORA_UART_INST_COUNT];
static nora_uart_event_callback_t event_callback[NORA_UART_INST_COUNT];
static void *event_callback_user_data[NORA_UART_INST_COUNT];

static const uint8_t   *tx_async_buf[NORA_UART_INST_COUNT];
static size_t           tx_async_len[NORA_UART_INST_COUNT];
static volatile size_t  tx_async_count[NORA_UART_INST_COUNT];
static volatile bool    tx_async_busy[NORA_UART_INST_COUNT];

static uint8_t         *rx_async_buf[NORA_UART_INST_COUNT];
static size_t           rx_async_len[NORA_UART_INST_COUNT];
static volatile size_t  rx_async_count[NORA_UART_INST_COUNT];
static volatile bool    rx_async_busy[NORA_UART_INST_COUNT];

static bool uart_inst_is_valid(nora_uart_instance_t inst);
static nora_uart_status_t uart_get_regs(
    nora_uart_instance_t inst,
    const nora_uart_dspic33ck_regs_t **regs);
static nora_uart_status_t uart_require_initialized(
    nora_uart_instance_t inst,
    const nora_uart_dspic33ck_regs_t **regs);
static nora_uart_status_t uart_calc_brg(
    const nora_uart_config_t *config,
    uint32_t *brg);
static nora_uart_status_t uart_calc_brg_raw(
    uint32_t uart_clk_hz,
    uint32_t baudrate,
    bool high_speed,
    uint32_t *brg);
static bool uart_timeout_enabled(nora_uart_instance_t inst);
static uint32_t uart_timeout_start_ms(nora_uart_instance_t inst);
static bool uart_timeout_expired(
    nora_uart_instance_t inst,
    uint32_t start_ms);
static void uart_interrupts_disable(nora_uart_instance_t inst);
static void uart_async_reset(nora_uart_instance_t inst);
static void uart_async_rx_arm(
    nora_uart_instance_t inst,
    uint8_t *data,
    size_t length);
static void uart_notify(nora_uart_instance_t inst, uint32_t events);

/* Some existing CK configurations use only the polling backend and deliberately
 * omit the RX ISR-ring object. These weak fallbacks keep the public snapshot
 * available there; an included ISR-ring backend supplies strong definitions. */
bool __attribute__((weak)) nora_uart_dspic33ck_rx_isr_is_configured(
    nora_uart_instance_t inst)
{
    (void)inst;
    return false;
}

void __attribute__((weak)) nora_uart_dspic33ck_rx_isr_status_get(
    nora_uart_instance_t inst,
    nora_uart_dspic33ck_rx_isr_status_t *status)
{
    (void)inst;

    if (status != 0) {
        memset(status, 0, sizeof(*status));
    }
}

void __attribute__((weak)) nora_uart_dspic33ck_rx_isr_status_clear(
    nora_uart_instance_t inst)
{
    (void)inst;
}

/* Same reason as above, for the paths nora_uart_init() and the byte-stream API
 * now take when rx_mode == ISR_RING. A build without the ISR-ring object cannot
 * offer the ring, and says so (_ERR_UNSUPPORTED) instead of quietly running the
 * caller on the FIFO under a config that asked for a ring. */
nora_uart_status_t __attribute__((weak)) nora_uart_dspic33ck_rx_isr_config(
    nora_uart_instance_t inst,
    const nora_uart_dspic33ck_rx_isr_config_t *config)
{
    (void)inst;
    (void)config;
    return NORA_UART_ERR_UNSUPPORTED;
}

nora_uart_status_t __attribute__((weak)) nora_uart_dspic33ck_rx_isr_enable(
    nora_uart_instance_t inst)
{
    (void)inst;
    return NORA_UART_ERR_UNSUPPORTED;
}

nora_uart_status_t __attribute__((weak)) nora_uart_dspic33ck_rx_isr_disable(
    nora_uart_instance_t inst)
{
    (void)inst;
    return NORA_UART_ERR_UNSUPPORTED;
}

bool __attribute__((weak)) nora_uart_dspic33ck_rx_isr_ready(
    nora_uart_instance_t inst)
{
    (void)inst;
    return false;
}

nora_uart_status_t __attribute__((weak)) nora_uart_dspic33ck_rx_isr_read_byte(
    nora_uart_instance_t inst,
    uint8_t *data)
{
    (void)inst;
    (void)data;
    return NORA_UART_ERR_UNSUPPORTED;
}

void __attribute__((weak)) nora_uart_dspic33ck_rx_isr_flush(
    nora_uart_instance_t inst)
{
    (void)inst;
}

nora_uart_status_t nora_uart_init(
    nora_uart_instance_t inst,
    const nora_uart_config_t *config)
{
    const nora_uart_dspic33ck_regs_t *r;
    uint32_t brg;
    nora_uart_status_t st;

    if (!uart_inst_is_valid(inst) || config == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    if (config->uart_clk_hz == 0u || config->baudrate == 0u ||
        config->data_bits != 8u || config->stop_bits != 1u ||
        config->parity != NORA_UART_PARITY_NONE ||
        (unsigned)config->clock_source > (unsigned)NORA_UART_BCLKSEL_REFCLK) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    if (config->rx_mode != NORA_UART_RX_MODE_POLLING &&
        config->rx_mode != NORA_UART_RX_MODE_ISR_RING) {
        return NORA_UART_ERR_INVALID_ARG;
    }

