sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
    /*
     * A CPU interrupt priority is a 3-bit field: 1..7 are the usable levels and 0
     * means "masked by CPU priority rules", i.e. this interrupt never runs. So a
     * value above 7 is not a slow interrupt, it is a truncated one -- writing 8
     * lands as 0 and silently disables the line. Refuse it for both directions
     * before anything is programmed.
     *
     * 0 is legal here and means "not using this interrupt": for TX it is what an
     * integration that never calls nora_uart_tx_start() passes, and the ISR-ring
     * block below rejects it for RX because a ring whose interrupt cannot fire is
     * exactly the silent-fallback shape this HAL refuses elsewhere.
     */
    if (config->rx_irq_priority > 7u || config->tx_irq_priority > 7u) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    /* Rejected here rather than after the peripheral is running, so a config that
     * asks for a ring it cannot have leaves the instance untouched. enable_rx is
     * part of it: an RX interrupt on a disabled receiver never fires. */
    if (config->rx_mode == NORA_UART_RX_MODE_ISR_RING) {
        if (config->rx_ring_buffer == 0 || config->rx_ring_buffer_size < 2u ||
            config->rx_irq_priority == 0u || !config->enable_rx) {
            return NORA_UART_ERR_INVALID_ARG;
        }
    }

    st = uart_get_regs(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    st = uart_calc_brg(config, &brg);
    if (st != NORA_UART_OK) {
        return st;
    }

    uart_interrupts_disable(inst);

    *r->MODE = 0u;
    *r->MODEH = 0u;
    *r->STA = 0u;
    *r->STAH = 0x0022u;
    *r->BRG = (uint16_t)(brg & 0xFFFFu);
    *r->BRGH = (uint16_t)((brg >> 16) & 0x000Fu);

    if (config->high_speed) {
        nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_BRGH);
    }

    nora_uart_dspic33ck_reg_write_field(
        r->MODEH,
        NORA_UART_DSPIC33CK_MODEH_BCLKSEL_MASK,
        (uint16_t)((uint16_t)config->clock_source << 9));

    if (config->enable_tx) {
        nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_UTXEN);
    }
    if (config->enable_rx) {
        nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN);
    }

    nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_UARTEN);

    timeout_ms[inst] = config->timeout_ms;
    get_ms[inst] = config->get_ms;
    baudrate_applied[inst] = config->baudrate;
    uart_clk_hz_applied[inst] = config->uart_clk_hz;
    initialized[inst] = true;

    /* Async transfer state starts clean, and the TX interrupt priority is
     * programmed here while its enable bit stays clear -- nora_uart_tx_start() is
     * what enables it. Also clears any callback a previous incarnation left. */
    uart_async_reset(inst);
    event_callback[inst] = 0;
    event_callback_user_data[inst] = 0;
    tx_irq_priority_applied[inst] = config->tx_irq_priority;
    if (config->tx_irq_priority != 0u &&
        !nora_uart_dspic33ck_device_set_tx_irq_priority(
            inst, config->tx_irq_priority)) {
        /*
         * The caller asked for async TX (a non-zero priority) on an instance whose
         * TX priority symbol this device does not name, so the priority was NOT
         * programmed. Discarding this result is how an async TX would later start
         * with its interrupt at whatever priority the reset left -- report instead,
         * and undo the init so a refused config leaves nothing half-configured.
         * A zero priority is not a request, so it is not an error.
         */
        (void)nora_uart_deinit(inst);
        return NORA_UART_ERR_UNSUPPORTED;
    }

    /* Set up after initialized[] is true because the ring's own config call
     * requires an initialized instance. A failure here undoes the whole init: the
     * caller asked for a ring, and half a UART is worse than none. */
    if (config->rx_mode == NORA_UART_RX_MODE_ISR_RING) {
        nora_uart_dspic33ck_rx_isr_config_t ring_config;

        ring_config.buffer = config->rx_ring_buffer;
        ring_config.buffer_size = config->rx_ring_buffer_size;
        ring_config.irq_priority = config->rx_irq_priority;

        st = nora_uart_dspic33ck_rx_isr_config(inst, &ring_config);
        if (st == NORA_UART_OK) {
            st = nora_uart_dspic33ck_rx_isr_enable(inst);
        }
        if (st != NORA_UART_OK) {
            (void)nora_uart_deinit(inst);
            return st;
        }
    }

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_deinit(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_get_regs(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* Ring first: it owns the RX interrupt enable, and taking the peripheral down
     * under a live RX ISR is the one order that can leave an interrupt pending on a
     * dead UART. */
    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        (void)nora_uart_dspic33ck_rx_isr_disable(inst);
    }

    uart_interrupts_disable(inst);
    *r->MODE = 0u;
    *r->MODEH = 0u;
    *r->STA = 0u;
    *r->STAH = 0u;
    *r->BRG = 0u;
    *r->BRGH = 0u;

    timeout_ms[inst] = 0u;
    get_ms[inst] = 0;
    baudrate_applied[inst] = 0u;
    uart_clk_hz_applied[inst] = 0u;
    initialized[inst] = false;

    /* Drop async transfer state and the callback: a transfer cannot outlive the
     * UART that was carrying it, and a stale callback would fire from the next
     * incarnation's ISR. */
    uart_async_reset(inst);
    event_callback[inst] = 0;
    event_callback_user_data[inst] = 0;
    tx_irq_priority_applied[inst] = 0u;

    return NORA_UART_OK;
}

bool nora_uart_is_present(nora_uart_instance_t inst)
{
    return nora_uart_dspic33ck_instance_is_present(inst);
}

bool nora_uart_is_initialized(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }

    return initialized[inst];
}

bool nora_uart_rx_ready(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

