sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return false;
    }

    /* ISR-ring mode answers from the ring, as the dsPIC33AK HAL does: the ISR has
     * already drained the FIFO, so asking the FIFO here would report "nothing to
     * read" with a ring full of bytes. The ring's own reader also ends a stalled
     * reception, which the FIFO path below cannot see. */
    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        return nora_uart_dspic33ck_rx_isr_ready(inst);
    }

    /*
     * ENDING A LATCHED OVERRUN IS THIS FUNCTION'S JOB, and that is a defect fix, not
     * a feature.  OERR stops the receiver: no further character enters the FIFO
     * until software clears it.  The only place that cleared it on this path was
     * nora_uart_read_byte(), which a polled reader reaches ONLY WHEN THIS
     * FUNCTION SAYS TRUE -- so once the FIFO drained, this said "nothing to read",
     * read_byte() was never called, OERR was never cleared, and reception was over
     * for the life of the image.  TX is untouched by any of it, so the board goes on
     * printing and looks healthy: MEASURED on EV88G73A, a console that echoed
     * nothing while the audio ISR ran 885 000 blocks with miss = 0, and only a reset
     * ended it.  The reader was the one thing still running, and it was the one thing
     * that could not get out.
     *
     * Cleared only with the FIFO EMPTY, which is what makes this lossless under
     * either family's semantics: the classic dsPIC UART resets the receive buffer
     * when OERR is cleared, so clearing it with characters still queued would throw
     * away a command line instead of receiving it.  With the FIFO empty there is
     * nothing to throw away, and that is exactly the stuck state -- OERR set, FIFO
     * empty, receiver halted -- this exists to leave.
     */
    if (nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_URXBE)) {
        if (nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_OERR)) {
            nora_uart_dspic33ck_reg_clear(r->STA, NORA_UART_DSPIC33CK_STA_OERR);
            rx_overrun_recovered[inst]++;
        }
        return false;
    }

    return true;
}

bool nora_uart_tx_ready(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return false;
    }

    return !nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_UTXBF);
}

bool nora_uart_tx_done(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return false;
    }

    return nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_TRMT);
}

nora_uart_status_t nora_uart_write_byte(
    nora_uart_instance_t inst,
    uint8_t data)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;
    uint32_t start_ms;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    start_ms = uart_timeout_start_ms(inst);
    while (nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_UTXBF)) {
        if (uart_timeout_enabled(inst) && uart_timeout_expired(inst, start_ms)) {
            return NORA_UART_ERR_TIMEOUT;
        }
    }

    *r->TXREG = data;
    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_read_byte(
    nora_uart_instance_t inst,
    uint8_t *data)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    if (data == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* ISR-ring mode reads the ring (AK contract). The error flags handled below
     * belong to the FIFO path; in ring mode the ISR is what clears them and counts
     * them into the ring's counters. */
    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        return nora_uart_dspic33ck_rx_isr_read_byte(inst, data);
    }

    /*
     * EVERY ERROR EXIT HERE MUST ALSO END THE CONDITION IT REPORTS, or the reader is
     * the thing that keeps the receiver stopped. FERR and PERR belong to the byte at
     * the head of the receive FIFO and the ONLY way to clear either one is to READ
     * RXREG -- so returning without that read left the errored byte in place, the flag
     * set, and this function returning the same error for the life of the image.
     *
     * MEASURED on EV88G73A 2026-08-11, deaf console reproduced on demand:
     * STA=000E (OERR|FERR) with STAH=001D (URXBF=1, URXBE=0 -- FIFO holding bytes),
     * rx byte count 0 since boot, and nothing the host typed was ever echoed. The
     * FIFO had filled ~8 s after boot, BEFORE the host sent anything: on the Nano
     * mounted to the motherboard the MCU is powered by the board while the debugger's
     * USB is unplugged, so the un-driven RX pin framed garbage into the FIFO. The
     * owner's sequence settles it -- power ON then plug USB reproduces it 100 % of the
     * time, plug USB then power ON never does.
     *
     * Note also what did NOT rescue it: nora_uart_rx_ready() clears OERR only with the
     * FIFO EMPTY (rightly -- see its comment), and this FIFO was full, so the rescue
     * never ran and its counter stayed 0. Discarding here is what makes progress, and
     * it discards nothing real: a framing or parity error means that byte was never a
     * valid character.
     */
    if (nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_OERR)) {
        nora_uart_dspic33ck_reg_clear(r->STA, NORA_UART_DSPIC33CK_STA_OERR);
        /* Counted here too, not just in rx_ready(): this path was clearing a latched
         * overrun silently, so `?du` reported 0 on a board that had had one. */
        rx_overrun_recovered[inst]++;
        return NORA_UART_ERR_OVERRUN;
    }
    if (nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_FERR)) {
        (void)*r->RXREG;
        rx_framing_polled[inst]++;
        return NORA_UART_ERR_FRAMING;
    }
    if (nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_PERR)) {
        (void)*r->RXREG;
        rx_parity_polled[inst]++;
        return NORA_UART_ERR_PARITY;
    }
    if (nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_URXBE)) {
        return NORA_UART_ERR_RX_EMPTY;
    }

