sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
    *data = (uint8_t)(*r->RXREG & 0x00FFu);
    rx_byte_polled[inst]++;
    return NORA_UART_OK;
}

size_t nora_uart_write(
    nora_uart_instance_t inst,
    const void *data,
    size_t len)
{
    const uint8_t *p = (const uint8_t *)data;
    size_t i;

    if (len != 0u && data == 0) {
        return 0u;
    }

    for (i = 0u; i < len; i++) {
        if (nora_uart_write_byte(inst, p[i]) != NORA_UART_OK) {
            break;
        }
    }

    return i;
}

size_t nora_uart_read(
    nora_uart_instance_t inst,
    void *data,
    size_t len)
{
    uint8_t *p = (uint8_t *)data;
    size_t i;

    if (len != 0u && data == 0) {
        return 0u;
    }

    for (i = 0u; i < len; i++) {
        if (nora_uart_read_byte(inst, &p[i]) != NORA_UART_OK) {
            break;
        }
    }

    return i;
}

void nora_uart_rx_flush(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return;
    }

    /* The ring's own flush is the whole job in ring mode -- it drops the ring AND
     * drains the FIFO AND clears OERR, all with the RX interrupt held off. Draining
     * the FIFO again from here would be a foreground RXREG read racing the ISR. */
    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        nora_uart_dspic33ck_rx_isr_flush(inst);
        return;
    }

    while (!nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_URXBE)) {
        (void)*r->RXREG;
    }

    if (nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_OERR)) {
        nora_uart_dspic33ck_reg_clear(r->STA, NORA_UART_DSPIC33CK_STA_OERR);
    }
}

nora_uart_status_t nora_uart_rx_status_get(
    nora_uart_instance_t inst,
    nora_uart_rx_status_t *status)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    if (status == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    memset(status, 0, sizeof(*status));
    status->rx_mode = NORA_UART_RX_MODE_POLLING;
    status->rx_overrun_recovered_count = rx_overrun_recovered[inst];
    /* Polled figures first, so an ISR-ring console overwrites them below with its
     * own. Without these a polling console reports zero errored bytes however
     * many it discarded -- and zero is also what a healthy board reports. The
     * byte count is here for the same reason: it is the number that shows
     * reception has stopped, and the ring's own count replaces it below. */
    status->framing_error_count = rx_framing_polled[inst];
    status->parity_error_count  = rx_parity_polled[inst];
    status->rx_byte_count       = rx_byte_polled[inst];

    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        nora_uart_dspic33ck_rx_isr_status_t isr_status;

        status->rx_mode = NORA_UART_RX_MODE_ISR_RING;
        nora_uart_dspic33ck_rx_isr_status_get(inst, &isr_status);

        status->rx_isr_count            = isr_status.rx_isr_count;
        status->rx_byte_count           = isr_status.rx_byte_count;
        status->rx_fifo_overflow_count  = isr_status.rx_fifo_overflow_count;
        status->framing_error_count     = isr_status.framing_error_count;
        status->parity_error_count      = isr_status.parity_error_count;
        status->rx_ring_overflow_count  = isr_status.rx_ring_overflow_count;
        status->rx_max_drain_count      = isr_status.rx_max_drain_count;
        status->rx_stall_recovery_count = isr_status.rx_stall_recovery_count;
        status->rx_ie_lost_count        = isr_status.rx_ie_lost_count;
    }

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_rx_status_clear(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    if (nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        nora_uart_dspic33ck_rx_isr_status_clear(inst);
    }
    rx_overrun_recovered[inst] = 0u;
    rx_framing_polled[inst] = 0u;
    rx_parity_polled[inst] = 0u;
    rx_byte_polled[inst] = 0u;

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_rx_regs_get(
    nora_uart_instance_t inst,
    nora_uart_rx_regs_t *out)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    if (out == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* Read only -- no clearing, no rescue. A diagnostic that repairs what it is
     * measuring cannot testify about it, and nora_uart_rx_ready() is already the
     * place that repairs OERR. */
    out->mode = *r->MODE;
    out->sta  = *r->STA;
    out->stah = *r->STAH;

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_tx_enable(
    nora_uart_instance_t inst,
    bool enable)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* Disabling TX under an active async transfer would strand it: no interrupt
     * would drain the rest and no SEND_COMPLETE would ever be reported. */
    if (!enable && tx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    if (enable) {
        nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_UTXEN);
    } else {
        nora_uart_dspic33ck_reg_clear(r->MODE, NORA_UART_DSPIC33CK_MODE_UTXEN);
    }

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_rx_enable(
    nora_uart_instance_t inst,
    bool enable)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* Same reason as nora_uart_tx_enable(): no bytes would arrive to finish the
     * transfer, so it would wait for an RX_COMPLETE that cannot come. */
    if (!enable && rx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    if (enable) {
        nora_uart_dspic33ck_reg_set(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN);
    } else {
        nora_uart_dspic33ck_reg_clear(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN);
    }

    return NORA_UART_OK;
}

