sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
bool nora_uart_tx_is_enabled(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return false;
    }

    return nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_UTXEN);
}

bool nora_uart_rx_is_enabled(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_require_initialized(inst, &r) != NORA_UART_OK) {
        return false;
    }

    return nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN);
}

nora_uart_status_t nora_uart_set_baudrate(
    nora_uart_instance_t inst,
    uint32_t uart_clk_hz,
    uint32_t baudrate)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;
    uint32_t brg;
    bool high_speed;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    if (uart_clk_hz == 0u || baudrate == 0u) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    /* Never reconfigure the divisor while the shifter still holds a character or
     * the write buffer is loaded: the byte in flight would finish at a different
     * rate than it started, which the receiver sees as a framing error rather
     * than as a rate change. */
    if (!nora_uart_dspic33ck_reg_is_set(r->STA, NORA_UART_DSPIC33CK_STA_TRMT) ||
        nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_UTXBF)) {
        return NORA_UART_ERR_BUSY;
    }

    /* An async transfer spans many characters, so an idle shifter says nothing
     * about it -- refuse for the whole transfer, as the dsPIC33AK HAL does. */
    if (tx_async_busy[inst] || rx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    /* Recompute in the mode the hardware is in, not in a mode the caller assumed. */
    high_speed =
        nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_BRGH);

    st = uart_calc_brg_raw(uart_clk_hz, baudrate, high_speed, &brg);
    if (st != NORA_UART_OK) {
        return st;
    }

    *r->BRG = (uint16_t)(brg & 0xFFFFu);
    *r->BRGH = (uint16_t)((brg >> 16) & 0x000Fu);

    uart_clk_hz_applied[inst] = uart_clk_hz;
    baudrate_applied[inst] = baudrate;

    return NORA_UART_OK;
}

uint32_t nora_uart_get_baudrate(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return 0u;
    }

    return baudrate_applied[inst];
}

/* ========================================================================== */
/* Asynchronous Transfer Model                                                */
/* ========================================================================== */

nora_uart_status_t nora_uart_set_callback(
    nora_uart_instance_t inst,
    nora_uart_event_callback_t callback,
    void *user_data)
{
    if (!uart_inst_is_valid(inst)) {
        return NORA_UART_ERR_INVALID_ARG;
    }
    if (!nora_uart_dspic33ck_instance_is_present(inst)) {
        return NORA_UART_ERR_NOT_PRESENT;
    }

    event_callback[inst] = callback;
    event_callback_user_data[inst] = user_data;

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_tx_start(
    nora_uart_instance_t inst,
    const uint8_t *data,
    size_t length)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }
    if (data == 0 || length == 0u) {
        return NORA_UART_ERR_INVALID_ARG;
    }
    if (tx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    /* Both of these would produce a transfer that never completes, so they are
     * refused up front rather than reported as started. */
    if (!nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_UTXEN)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (tx_irq_priority_applied[inst] == 0u) {
        return NORA_UART_ERR_UNSUPPORTED;
    }

    /* Publish the descriptor before arming the interrupt. */
    tx_async_buf[inst]   = data;
    tx_async_len[inst]   = length;
    tx_async_count[inst] = 0u;
    tx_async_busy[inst]  = true;

    (void)nora_uart_dspic33ck_device_tx_irq_flag_clear(inst);
    if (!nora_uart_dspic33ck_device_tx_irq_enable(inst, true)) {
        tx_async_busy[inst] = false;
        return NORA_UART_ERR_UNSUPPORTED;
    }
    /* Raise the flag by hand: the TX interrupt means "the FIFO has room", which is
     * already true here, so nothing would latch it and the engine would wait for a
     * condition that had already passed. */
    (void)nora_uart_dspic33ck_device_tx_irq_raise_flag(inst);

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_tx_abort(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    (void)nora_uart_dspic33ck_device_tx_irq_enable(inst, false);
    (void)nora_uart_dspic33ck_device_tx_irq_flag_clear(inst);
    tx_async_busy[inst] = false;

    return NORA_UART_OK;
}

size_t nora_uart_tx_count_get(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return 0u;
    }

    return tx_async_count[inst];
}

bool nora_uart_tx_is_busy(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }

    return tx_async_busy[inst];
}

nora_uart_status_t nora_uart_rx_start(
    nora_uart_instance_t inst,
    uint8_t *data,
    size_t length)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }
    if (data == 0 || length == 0u) {
        return NORA_UART_ERR_INVALID_ARG;
    }
    /* Async RX is fed from the RX ISR, which only runs in ISR-ring mode. */
    if (!nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (!nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (rx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    /* The RX interrupt is already enabled by the ring backend;
     * nora_uart_dspic33ck_async_rx_feed() picks bytes up as soon as busy is true. */
    uart_async_rx_arm(inst, data, length);

    return NORA_UART_OK;
}

