sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
nora_uart_status_t nora_uart_rx_start_clean(
    nora_uart_instance_t inst,
    uint8_t *data,
    size_t length)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;
    uint8_t rx_irq_enabled;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }
    if (data == 0 || length == 0u) {
        return NORA_UART_ERR_INVALID_ARG;
    }
    if (!nora_uart_dspic33ck_rx_isr_is_configured(inst)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (!nora_uart_dspic33ck_reg_is_set(r->MODE, NORA_UART_DSPIC33CK_MODE_URXEN)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (rx_async_busy[inst]) {
        return NORA_UART_ERR_BUSY;
    }

    rx_irq_enabled = nora_uart_dspic33ck_device_rx_irq_get_enable(inst);
    if (rx_irq_enabled == 0u) {
        return NORA_UART_ERR_UNSUPPORTED;
    }
    if (!nora_uart_dspic33ck_device_rx_irq_enable(inst, false)) {
        return NORA_UART_ERR_UNSUPPORTED;
    }

    /* Drop what predates this call, then arm while the RX ISR cannot move a
     * just-arrived byte into the regular ring. Doing the flush and the arm under
     * one disable is the whole point of this entry point existing. */
    nora_uart_dspic33ck_rx_isr_flush(inst);
    uart_async_rx_arm(inst, data, length);

    (void)nora_uart_dspic33ck_device_rx_irq_enable(inst, true);

    return NORA_UART_OK;
}

nora_uart_status_t nora_uart_rx_abort(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;
    nora_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != NORA_UART_OK) {
        return st;
    }

    /* Single volatile flag write; the RX feed hook re-checks it before each store. */
    rx_async_busy[inst] = false;

    return NORA_UART_OK;
}

size_t nora_uart_rx_count_get(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return 0u;
    }

    return rx_async_count[inst];
}

bool nora_uart_rx_is_busy(nora_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }

    return rx_async_busy[inst];
}

void nora_uart_tx_irq_handler(nora_uart_instance_t inst)
{
    const nora_uart_dspic33ck_regs_t *r;

    if (uart_get_regs(inst, &r) != NORA_UART_OK) {
        return;
    }

    (void)nora_uart_dspic33ck_device_tx_irq_flag_clear(inst);

    /* Spurious or aborted: nothing to send, so make sure the interrupt is off
     * instead of re-entering forever. */
    if (!tx_async_busy[inst]) {
        (void)nora_uart_dspic33ck_device_tx_irq_enable(inst, false);
        return;
    }

    while ((tx_async_count[inst] < tx_async_len[inst]) &&
           !nora_uart_dspic33ck_reg_is_set(r->STAH, NORA_UART_DSPIC33CK_STAH_UTXBF)) {
        *r->TXREG = tx_async_buf[inst][tx_async_count[inst]];
        tx_async_count[inst]++;
    }

    /* All bytes submitted to the FIFO: stop the interrupt and report complete.
     * SEND_COMPLETE is the "driver accepted and submitted all data" sense;
     * physical shift-register-empty stays observable via nora_uart_tx_done(). */
    if (tx_async_count[inst] >= tx_async_len[inst]) {
        (void)nora_uart_dspic33ck_device_tx_irq_enable(inst, false);
        tx_async_busy[inst] = false;
        uart_notify(inst, NORA_UART_EVENT_SEND_COMPLETE);
    }
}

/* ----- Internal hooks called from the RX ISR ------------------------------ */
/* Strong definitions overriding the weak no-ops in
 * nora_uart_dspic33ck_rx_isr_ring.c: this file IS the async layer that header
 * said could be added later. */

bool nora_uart_dspic33ck_async_rx_feed(
    nora_uart_instance_t inst,
    uint8_t byte)
{
    if (!uart_inst_is_valid(inst) || !rx_async_busy[inst]) {
        return false;
    }

    rx_async_buf[inst][rx_async_count[inst]] = byte;
    rx_async_count[inst]++;

    if (rx_async_count[inst] >= rx_async_len[inst]) {
        rx_async_busy[inst] = false;
        uart_notify(inst, NORA_UART_EVENT_RX_COMPLETE);
    }

    return true;
}

void nora_uart_dspic33ck_async_notify_events(
    nora_uart_instance_t inst,
    uint32_t events)
{
    if (!uart_inst_is_valid(inst) || events == 0u) {
        return;
    }

    uart_notify(inst, events);
}

static bool uart_inst_is_valid(nora_uart_instance_t inst)
{
    return ((unsigned)inst < (unsigned)NORA_UART_INST_COUNT);
}

static nora_uart_status_t uart_get_regs(
    nora_uart_instance_t inst,
    const nora_uart_dspic33ck_regs_t **regs)
{
    const nora_uart_dspic33ck_device_t *dev;

    if (regs == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    if (!uart_inst_is_valid(inst)) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    dev = nora_uart_dspic33ck_get_device(inst);
    if (dev == 0) {
        return NORA_UART_ERR_NOT_PRESENT;
    }

    *regs = &dev->regs;
    return NORA_UART_OK;
}

static nora_uart_status_t uart_require_initialized(
    nora_uart_instance_t inst,
    const nora_uart_dspic33ck_regs_t **regs)
{
    nora_uart_status_t st;

    st = uart_get_regs(inst, regs);
    if (st != NORA_UART_OK) {
        return st;
    }

    if (!initialized[inst]) {
        return NORA_UART_ERR_NOT_INITIALIZED;
    }

    return NORA_UART_OK;
}

static nora_uart_status_t uart_calc_brg(
    const nora_uart_config_t *config,
    uint32_t *brg)
{
    return uart_calc_brg_raw(
        config->uart_clk_hz, config->baudrate, config->high_speed, brg);
}

/*
 * The divisor maths itself, without a config object.
 *
 * nora_uart_set_baudrate() has no config to pass: it must recompute against the
 * sample-rate mode the hardware is ALREADY in, read back from MODE.BRGH. Keeping
 * one implementation means the two paths cannot disagree about rounding.
 */
static nora_uart_status_t uart_calc_brg_raw(
    uint32_t uart_clk_hz,
    uint32_t baudrate,
    bool high_speed,
    uint32_t *brg)
{
    const uint32_t sample_div = high_speed ? 4u : 16u;
    const uint64_t denominator = (uint64_t)sample_div * baudrate;
    uint64_t div;

    if (denominator == 0u || brg == 0) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    div = ((uint64_t)uart_clk_hz + (denominator / 2u)) / denominator;
    if (div == 0u || (div - 1u) > NORA_UART_BRG_MAX) {
        return NORA_UART_ERR_INVALID_ARG;
    }

    *brg = (uint32_t)(div - 1u);
    return NORA_UART_OK;
}

static bool uart_timeout_enabled(nora_uart_instance_t inst)
{
    return uart_inst_is_valid(inst) &&
           get_ms[inst] != 0 &&
           timeout_ms[inst] != 0u;
}

static uint32_t uart_timeout_start_ms(nora_uart_instance_t inst)
{
    if (!uart_timeout_enabled(inst)) {
        return 0u;
    }

    return get_ms[inst]();
}

