sulaolab/nora-hal-dspic33ck-uart/src/nora_uart_dspic33ck.c
static bool uart_timeout_expired(
    nora_uart_instance_t inst,
    uint32_t start_ms)
{
    uint32_t now;

    if (!uart_timeout_enabled(inst)) {
        return false;
    }

    now = get_ms[inst]();
    return ((uint32_t)(now - start_ms) >= timeout_ms[inst]);
}

static void uart_interrupts_disable(nora_uart_instance_t inst)
{
    switch (inst) {
#if defined(_U1RXIE)
    case NORA_UART_INST_1:
        _U1RXIE = 0;
        _U1TXIE = 0;
        _U1EIE = 0;
        _U1EVTIE = 0;
        _U1RXIF = 0;
        _U1TXIF = 0;
        _U1EIF = 0;
        _U1EVTIF = 0;
        break;
#endif
#if defined(_U2RXIE)
    case NORA_UART_INST_2:
        _U2RXIE = 0;
        _U2TXIE = 0;
        _U2EIE = 0;
        _U2EVTIE = 0;
        _U2RXIF = 0;
        _U2TXIF = 0;
        _U2EIF = 0;
        _U2EVTIF = 0;
        break;
#endif
#if defined(_U3RXIE)
    case NORA_UART_INST_3:
        _U3RXIE = 0;
        _U3TXIE = 0;
        _U3EIE = 0;
        _U3EVTIE = 0;
        _U3RXIF = 0;
        _U3TXIF = 0;
        _U3EIF = 0;
        _U3EVTIF = 0;
        break;
#endif
    default:
        break;
    }
}

static void uart_async_reset(nora_uart_instance_t inst)
{
    tx_async_buf[inst]   = 0;
    tx_async_len[inst]   = 0u;
    tx_async_count[inst] = 0u;
    tx_async_busy[inst]  = false;

    rx_async_buf[inst]   = 0;
    rx_async_len[inst]   = 0u;
    rx_async_count[inst] = 0u;
    rx_async_busy[inst]  = false;
}

static void uart_async_rx_arm(
    nora_uart_instance_t inst,
    uint8_t *data,
    size_t length)
{
    rx_async_buf[inst]   = data;
    rx_async_len[inst]   = length;
    rx_async_count[inst] = 0u;
    /* Published last: the feed hook keys off this flag, so the buffer and the
     * length must already be visible when it becomes true. */
    rx_async_busy[inst]  = true;
}

static void uart_notify(nora_uart_instance_t inst, uint32_t events)
{
    nora_uart_event_callback_t cb = event_callback[inst];

    if (cb != 0) {
        cb(inst, events, event_callback_user_data[inst]);
    }
}
